MyHome/src/InformationRegisters/мх_ЖурналСообщенийИнтеграции/мх_ЖурналСообщенийИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мх_ЖурналСообщенийИнтеграции</name>
  <resources>
    <name>ДатаЗапросаУниверсальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТелоЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТелоОтвета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КодОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.мх_ВнешниеСистемы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MyHome/src/CommonModules/мх_ИнтеграцияСВнешнимиСистемамиВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьВЖурналСообщенийИнтеграции(ПараметрыОтправки, СтруктураВозврата) Экспорт
	
	ПараметрыЖурнала = Новый Структура;
	ПараметрыЖурнала.Вставить("АдресСервера"	, ПараметрыОтправки.АдресСервера);
	ПараметрыЖурнала.Вставить("АдресРесурса"	, ПараметрыОтправки.Ресурс);
	ПараметрыЖурнала.Вставить("ТелоЗапроса"		, ПараметрыОтправки.Данные);
	
	ПараметрыЖурнала.Вставить("ТелоОтвета"		, СтруктураВозврата.Тело);
	ПараметрыЖурнала.Вставить("КодОтвета"		, СтруктураВозврата.КодСостояния);
	ПараметрыЖурнала.Вставить("ВнешняяСистема"	, СтруктураВозврата.ВнешняяСистема);
	
	РегистрыСведений.мх_ЖурналСообщенийИнтеграции.ДобавитьЗаписьЖурналаРегистрации(ПараметрыЖурнала);	
	
КонецПроцедуры

#КонецОбласти
